<?php 
//--- cutrue code  --- รหัสเฉพาะตัวของสมาชิก ดูได้ที่หน้า "ข้อมูลส่วนตัว" www.cutrue.net
$cutrue_code = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";

//--- host name --- ชื่อโฮส **ส่วนมากไม่จำเป็นต้องเปลี่ยน
$dbhost="localhost";
//--- username database   --- ยูสเซอร์เนมดาต้าเบสที่ใช้งาน
$dbusername="root";
//--- password database  --- พาสเวิร์ดดาต้าเบสที่ใช้งาน
$dbpassword="12345";
//--- database name --- ชื่อดาต้าเบสที่ใช้งาน
$db="ragnarok"; 

//--- login table  --- ตารางที่เก็บ ยูสเซอร์เนมและพาสเวิรด์และเก็บแต้ม
$login_table="login";
//--- account_id field  --- ฟิลด์รหัส หรือ ฟิลด์ที่เก็บยูสเซอร์เนม
$login_account_id_field="account_id";
//--- login userid field  --- ฟิลด์ที่เก็บยูสเซอร์เนม
$login_userid_field="userid";
//--- login user_pass field  --- ฟิลด์ที่เก็บพาสเวิร์ด
$login_user_pass_field="user_pass";


//--- Set Value Truemoney  --- มูลค่าแต้มที่จะได้รับ ต่อราคาบัตร 50,90,150,300,500,1000
$card_50 = 500;
$card_90 = 900;
$card_150 = 1500;
$card_300 = 3000;
$card_500 = 5000;
$card_1000 = 10000;

//--- Set Card Item Bonus   --- ระบบโบนัส เมื่อลูกค้าเติมเงินตามราคาบัตร
//--- ตั่งค่าโบนัสเมื่อเติมราคาบัตรที่กำหนด และไอเทมที่จะได้รับ พร้อมจำนวน
//--- ตัวอย่างการเซ็ตโบนัส
//--- $bonus_card[ราคาบัตร] = เลขไอเทมไอดี,ชื่อไอเทม,จำนวนไอเทม&&เลขไอเทมไอดี,ชื่อไอเทม,จำนวนไอเทม&&....
$bonus_card[50] = "14232,Yggdrasil Berry Box(10),3";
$bonus_card[90] = "14232,Yggdrasil Berry Box(10),3";
$bonus_card[150] = "14232,Yggdrasil Berry Box(10),3";
$bonus_card[300] = "14232,Yggdrasil Berry Box(10),3";
$bonus_card[500] = "7619,Enriched Elunium,2&&7620,Enriched Oridecon,2";
$bonus_card[1000] = "7619,Enriched Elunium,2&&7620,Enriched Oridecon,2";


//--- Set Item Bonus  --- ระบบโบนัส เมื่อลูกค้าเติมเงินครบตามที่กำหนด
//--- ตั้งวันจัดโปรโมชั่น  รูปแบบวันที่คือ  "YYYY-MM-DD" หากเป็นเลขตัวเดียวเช่น เดือน 4 ก็ใส่ 04 หรือวันที่ 9 ก็ใส่ 09 นะครับ
//--- วันเริ่มต้น
$bonus_start = "2011-03-01";
//--- วันหมด
$bonus_end = "2011-04-30";

//--- ตั่งค่าโบนัสเมื่อเติมครบจำนวนที่กำหนด และไอเทมที่จะได้รับ พร้อมจำนวน
//--- ตัวอย่างการเซ็ตโบนัส
//--- $bonus[จำนวนยอดการเติมเงินสะสม] = เลขไอเทมไอดี,ชื่อไอเทม,จำนวนไอเทม&&เลขไอเทมไอดี,ชื่อไอเทม,จำนวนไอเทม&&....

$bonus[500] = "14232,Yggdrasil Berry Box(10),3";
$bonus[1000] = "7619,Enriched Elunium,2&&7620,Enriched Oridecon,2";
$bonus[2000] = "1111,ชื่อไอเทม1,1&&2222,ชื่อไอเทม2,1";
$bonus[3000] = "3333,ชื่อไอเทม3,5&&4444,ชื่อไอเทม4,5&&5555,ชื่อไอเทม5,5";
$bonus[4000] = "6666,ชื่อไอเทม6,20&&7777,ชื่อไอเทม7,20&8888,ชื่อไอเทม8,20&&9999,ชื่อไอเทม9,20";

?> 